dataset_gen/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_2/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15708
(
0.00390625
0.0117188
0.0195313
0.0273438
0.0351563
0.0429688
0.0507813
0.0585938
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<scalar> 
104
(
0.402344
0.410157
0.417969
0.425782
0.433594
0.441407
0.449219
0.457031
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
