dataset_gen/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       31108;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-1 0 1.387778780781446e-17);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       31236;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (1 0 -1.387778780781446e-17);
    }
    bottom
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       31364;
        matchTolerance  0.0001;
        neighbourPatch  top;
        transformType   translational;
        separation      (0 -1 -1.387778780781446e-17);
    }
    top
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       31492;
        matchTolerance  0.0001;
        neighbourPatch  bottom;
        transformType   translational;
        separation      (0 1 1.387778780781446e-17);
    }
    hole
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       31620;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          31416;
        startFace       31724;
    }
)

// ************************************************************************* //
